WS/WebContent/json/request5.xml

<?xml version="1.0" encoding="UTF-8"?>

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:bas="http://crm.huawei.com/basetype/" xmlns:ser="http://crm.huawei.com/service/">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<ser:SubmitOrderRequest>
			<ser:RequestHeader>
				<bas:TransactionId>20151030023218602505</bas:TransactionId>
				<bas:ChannelId>18</bas:ChannelId>
				<bas:TechnicalChannelId>53</bas:TechnicalChannelId>
				<bas:AccessUser>ipcc</bas:AccessUser>
				<bas:AccessPwd>r8q0a5WwGNboj9I35XzNcQ==</bas:AccessPwd>
			</ser:RequestHeader>
			<ser:SubmitRequestBody>
				<ser:Order>
					<bas:OrderType>CO024</bas:OrderType>
				</ser:Order>
				<ser:OrderItems>
					<bas:OrderItem>
						<bas:OrderItemInfo>
							<bas:OrderItemType>CO024</bas:OrderItemType>
						</bas:OrderItemInfo>
						<bas:Subscriber>
							<bas:ServiceNumber>962138364</bas:ServiceNumber>
							<bas:PrimaryOfferingInfo>
								<bas:OfferingInfo>
									<bas:ActionType>2</bas:ActionType>
									<bas:OfferingId>
										<bas:OfferingId>111222233</bas:OfferingId>
									</bas:OfferingId>
								</bas:OfferingInfo>
							</bas:PrimaryOfferingInfo>
						</bas:Subscriber>
					</bas:OrderItem>
				</ser:OrderItems>
			</ser:SubmitRequestBody>
		</ser:SubmitOrderRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>